---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.DuplicateInstances
source: html/4720819c-25b8-a25d-ee4e-530e043cb60f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.DuplicateInstances Property

There are duplicate instances of the same family in the same place. Delete duplicate instances to improve performance.

## Syntax (C#)
```csharp
public static FailureDefinitionId DuplicateInstances { get; }
```